In [4]:
#importando la librería
import pandas as pd
import requests

In [9]:
#dirección en donde se encuntra la tabla
url ='https://smn.conagua.gob.mx/tools/RESOURCES/com_archivo_datos_resumenes/201901010000Lluv.csv'

In [11]:
#leer la tabla y guardarla en df
df = pd.read_csv(url, encoding='latin')

In [12]:
#solo ver la parte superior de la tabla
df.head()

          LON        LAT  EDO CLAVE_SIH                       NOMBRE    ENE
0 -102.309722  21.895000  AGS     AGSAG         Aguascalientes, Ags.   6.61
1 -102.466944  22.188611  AGS     ANVAG  Cincuenta Aniversario, Ags.  10.60
2 -102.184167  21.738611  AGS     BRTAG            San Bartolo, Ags.  10.50
3 -102.712222  21.849167  AGS  CALVILLO          Calvillo, Ags. SMN*  18.17
4 -102.676944  21.997500  AGS     CDRAG            La Codorniz, Ags.  16.70

In [13]:
#Ver los datos que se encuntran en la parte inferior
df.tail()

             LON        LAT  EDO CLAVE_SIH                       NOMBRE    ENE
1236 -102.344167  23.288611  ZAC     VCOZC           Villa de Cos, Zac.   7.00
1237 -101.916944  22.520278  ZAC     VGOZC  Villa González Ortega, Zac.  32.32
1238 -101.715833  22.347500  ZAC     VHGZC          Villa Hidalgo, Zac.   9.70
1239 -103.337500  21.588889  ZAC     VILZC     José María Morelos, Zac.  15.20
1240 -102.576667  22.761389  ZAC     ZACZC              Zacatecas, Zac.  12.02

In [14]:
#Conocer el directorio donde se esta trabajando
pwd

'/Users/joseramirezrodriguez/Documents/Laboratorio/dcida2020ii-JJRamirezR/Sep4'

In [17]:
df.index

RangeIndex(start=0, stop=1241, step=1)

In [20]:
#crear el nombre del archivo
nombre = 'lluvia_2019.csv'

In [22]:
#guardar el archivo
df.to_csv(nombre)

In [23]:
#leer el archivo que ya tengo guardado, como el archivo se encuentra en el directorio
#de trabajo del programa, no es necesario especificarle la ruta.
df2=pd.read_csv('lluvia_2019.csv')

In [24]:
df2.head()

,Unnamed: 0,LON,LAT,EDO,CLAVE_SIH,NOMBRE,ENE
0,0,-102.309722,21.895000,AGS,AGSAG,"Aguascalientes, Ags.",6.61
1,1,-102.466944,22.188611,AGS,ANVAG,"Cincuenta Aniversario, Ags.",10.60
2,2,-102.184167,21.738611,AGS,BRTAG,"San Bartolo, Ags.",10.50
3,3,-102.712222,21.849167,AGS,CALVILLO,"Calvillo, Ags. SMN*",18.17
4,4,-102.676944,21.997500,AGS,CDRAG,"La Codorniz, Ags.",16.70

# Cargar tabla que este en formato html

In [5]:
url2='https://www.indexmundi.com/map/?t=0&v=25&r=na&l=en'

In [23]:
html = requests.get(url2).content
df_list =pd.read_html(html, header=0)
#df_list=pd.read_html(html,header=1)

In [26]:
df2=df_list[1]

In [56]:
# Genero un vector con los nombres que voy a cambiar en los encabezados.
cabecera=['País','Tasa','Año']

In [57]:
#Cambio el nombre de los encabezados
df2.columns=cabecera

In [58]:
df2.values

array([['Mexico', 18, 2018],
       ['Greenland', 14, 2018],
       ['United States', 12, 2018],
       ['Canada', 10, 2018]], dtype=object)

In [59]:
df2.index

RangeIndex(start=0, stop=4, step=1)

In [60]:
df2

            País  Tasa   Año
0         Mexico    18  2018
1      Greenland    14  2018
2  United States    12  2018
3         Canada    10  2018

In [61]:
df2['Año']

0    2018
1    2018
2    2018
3    2018
Name: Año, dtype: int64

In [62]:
df2.columns

Index(['País', 'Tasa', 'Año'], dtype='object')

In [63]:
df2.T

           0          1              2       3
País  Mexico  Greenland  United States  Canada
Tasa      18         14             12      10
Año     2018       2018           2018    2018

In [65]:
df2.loc[df2.Tasa > 12,['País','Tasa']]

        País  Tasa
0     Mexico    18
1  Greenland    14

In [68]:
df2[df2.Tasa < 12]

     País  Tasa   Año
3  Canada    10  2018

# Diccionarios

In [35]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [36]:
population['California']

38332521

In [37]:
population['California':'Illinois']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

## Series as dictionary

In [49]:
data= pd.Series([0.25, 0.5, 0.75, 1.0],
               index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [50]:
data['b']

0.5

In [51]:
'a' in data

True

In [52]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [53]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [54]:
data['e']=1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64